cfd_geometry/tesla_cybertruck/open_bed/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 3.3398e-05;

boundaryField
{
    tarmac
    {
        type            epsilonWallFunction;
        value           uniform 3.3398e-05;
    }
    upperArea
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 3.3398e-05;
    }
    outlet
    {
        type            zeroGradient;
    }
    lateralArea
    {
        type            zeroGradient;
    }
    symmetryPlane
    {
        type            symmetry;
    }
    bodyCassoneAperto_mm
    {
        type            epsilonWallFunction;
        value           uniform 3.3398e-05;
    }
    FR_mm
    {
        type            epsilonWallFunction;
        value           uniform 3.3398e-05;
    }
    RR_mm
    {
        type            epsilonWallFunction;
        value           uniform 3.3398e-05;
    }
}


// ************************************************************************* //
